
# Auto-generated by Interface Designer
#
# WARNING: Any manual changes made to this file will be lost when generating constraints.

# Efinity Interface Designer SDC
# Version: 2024.2.294.4.12
# Date: 2025-03-24 01:18

# Copyright (C) 2013 - 2024 Efinix Inc. All rights reserved.

# Device: Ti180J484
# Project: Ti180_mipi
# Timing Model: C4 (final)

# PLL Constraints
#################
create_clock -period 4.800 -name pixel_clk [get_ports {pixel_clk}]
create_clock -period 10.000 -name mipi_clk [get_ports {mipi_clk}]
create_clock -period 10.000 -name cfg_clk [get_ports {cfg_clk}]
create_clock -period 50.000 -name esc_clk [get_ports {esc_clk}]

# GPIO Constraints
####################
# set_input_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {pll_refclk}]
# set_input_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {pll_refclk}]

# MIPI DPHY RX Constraints
#####################################
create_clock -period 6.4000 -name mipi_dphy_rx_inst2_SLOWCLK [get_ports {mipi_dphy_rx_inst2_SLOWCLK}]
#create_clock -period 6.4000 -name mipi_dphy_rx_inst2_LP_CLK [get_ports {mipi_dphy_rx_inst2_LP_CLK}]
set_output_delay -clock mipi_dphy_rx_inst2_SLOWCLK -reference_pin [get_ports {mipi_dphy_rx_inst2_SLOWCLK~CLKOUT~1~38}] -max 0.835 [get_ports {mipi_dphy_rx_inst2_RST0_N}]
set_output_delay -clock mipi_dphy_rx_inst2_SLOWCLK -reference_pin [get_ports {mipi_dphy_rx_inst2_SLOWCLK~CLKOUT~1~38}] -min 0.089 [get_ports {mipi_dphy_rx_inst2_RST0_N}]
# set_input_delay -clock <CLOCK> -max 4.343 [get_ports {mipi_dphy_rx_inst2_RX_DATA_ESC[*]}]
# set_input_delay -clock <CLOCK> -min 2.895 [get_ports {mipi_dphy_rx_inst2_RX_DATA_ESC[*]}]
# set_input_delay -clock <CLOCK> -max 4.039 [get_ports {mipi_dphy_rx_inst2_RX_LPDT_ESC}]
# set_input_delay -clock <CLOCK> -min 2.693 [get_ports {mipi_dphy_rx_inst2_RX_LPDT_ESC}]
# set_input_delay -clock <CLOCK> -max 3.907 [get_ports {mipi_dphy_rx_inst2_RX_TRIGGER_ESC[3] mipi_dphy_rx_inst2_RX_TRIGGER_ESC[2] mipi_dphy_rx_inst2_RX_TRIGGER_ESC[1] mipi_dphy_rx_inst2_RX_TRIGGER_ESC[0]}]
# set_input_delay -clock <CLOCK> -min 2.605 [get_ports {mipi_dphy_rx_inst2_RX_TRIGGER_ESC[3] mipi_dphy_rx_inst2_RX_TRIGGER_ESC[2] mipi_dphy_rx_inst2_RX_TRIGGER_ESC[1] mipi_dphy_rx_inst2_RX_TRIGGER_ESC[0]}]
# set_input_delay -clock <CLOCK> -max 3.387 [get_ports {mipi_dphy_rx_inst2_RX_ULPS_ESC_LAN0}]
# set_input_delay -clock <CLOCK> -min 2.258 [get_ports {mipi_dphy_rx_inst2_RX_ULPS_ESC_LAN0}]
# set_input_delay -clock <CLOCK> -max 3.465 [get_ports {mipi_dphy_rx_inst2_RX_VALID_ESC}]
# set_input_delay -clock <CLOCK> -min 2.310 [get_ports {mipi_dphy_rx_inst2_RX_VALID_ESC}]
# set_input_delay -clock <CLOCK> -max 3.783 [get_ports {mipi_dphy_rx_inst2_RX_ULPS_ESC_LAN1}]
# set_input_delay -clock <CLOCK> -min 2.522 [get_ports {mipi_dphy_rx_inst2_RX_ULPS_ESC_LAN1}]
# set_input_delay -clock <CLOCK> -max 4.925 [get_ports {mipi_dphy_rx_inst2_RX_ULPS_ESC_LAN2}]
# set_input_delay -clock <CLOCK> -min 3.283 [get_ports {mipi_dphy_rx_inst2_RX_ULPS_ESC_LAN2}]
# set_input_delay -clock <CLOCK> -max 3.289 [get_ports {mipi_dphy_rx_inst2_RX_ULPS_ESC_LAN3}]
# set_input_delay -clock <CLOCK> -min 2.192 [get_ports {mipi_dphy_rx_inst2_RX_ULPS_ESC_LAN3}]
#set_input_delay -clock mipi_dphy_rx_inst2_SLOWCLK -reference_pin [get_ports {mipi_dphy_rx_inst2_SLOWCLK~CLKOUT~1~38}] -max 1.607 [get_ports {mipi_dphy_rx_inst2_ERR_SOT_HS_LAN0}]
#set_input_delay -clock mipi_dphy_rx_inst2_SLOWCLK -reference_pin [get_ports {mipi_dphy_rx_inst2_SLOWCLK~CLKOUT~1~38}] -min 1.071 [get_ports {mipi_dphy_rx_inst2_ERR_SOT_HS_LAN0}]
#set_input_delay -clock mipi_dphy_rx_inst2_SLOWCLK -reference_pin [get_ports {mipi_dphy_rx_inst2_SLOWCLK~CLKOUT~1~38}] -max 1.619 [get_ports {mipi_dphy_rx_inst2_ERR_SOT_HS_LAN1}]
#set_input_delay -clock mipi_dphy_rx_inst2_SLOWCLK -reference_pin [get_ports {mipi_dphy_rx_inst2_SLOWCLK~CLKOUT~1~38}] -min 1.079 [get_ports {mipi_dphy_rx_inst2_ERR_SOT_HS_LAN1}]
#set_input_delay -clock mipi_dphy_rx_inst2_SLOWCLK -reference_pin [get_ports {mipi_dphy_rx_inst2_SLOWCLK~CLKOUT~1~38}] -max 1.559 [get_ports {mipi_dphy_rx_inst2_ERR_SOT_HS_LAN2}]
#set_input_delay -clock mipi_dphy_rx_inst2_SLOWCLK -reference_pin [get_ports {mipi_dphy_rx_inst2_SLOWCLK~CLKOUT~1~38}] -min 1.040 [get_ports {mipi_dphy_rx_inst2_ERR_SOT_HS_LAN2}]
#set_input_delay -clock mipi_dphy_rx_inst2_SLOWCLK -reference_pin [get_ports {mipi_dphy_rx_inst2_SLOWCLK~CLKOUT~1~38}] -max 1.570 [get_ports {mipi_dphy_rx_inst2_ERR_SOT_HS_LAN3}]
#set_input_delay -clock mipi_dphy_rx_inst2_SLOWCLK -reference_pin [get_ports {mipi_dphy_rx_inst2_SLOWCLK~CLKOUT~1~38}] -min 1.046 [get_ports {mipi_dphy_rx_inst2_ERR_SOT_HS_LAN3}]
#set_input_delay -clock mipi_dphy_rx_inst2_SLOWCLK -reference_pin [get_ports {mipi_dphy_rx_inst2_SLOWCLK~CLKOUT~1~38}] -max 1.667 [get_ports {mipi_dphy_rx_inst2_ERR_SOT_SYNC_HS_LAN0}]
#set_input_delay -clock mipi_dphy_rx_inst2_SLOWCLK -reference_pin [get_ports {mipi_dphy_rx_inst2_SLOWCLK~CLKOUT~1~38}] -min 1.112 [get_ports {mipi_dphy_rx_inst2_ERR_SOT_SYNC_HS_LAN0}]
#set_input_delay -clock mipi_dphy_rx_inst2_SLOWCLK -reference_pin [get_ports {mipi_dphy_rx_inst2_SLOWCLK~CLKOUT~1~38}] -max 1.613 [get_ports {mipi_dphy_rx_inst2_ERR_SOT_SYNC_HS_LAN1}]
#set_input_delay -clock mipi_dphy_rx_inst2_SLOWCLK -reference_pin [get_ports {mipi_dphy_rx_inst2_SLOWCLK~CLKOUT~1~38}] -min 1.075 [get_ports {mipi_dphy_rx_inst2_ERR_SOT_SYNC_HS_LAN1}]
#set_input_delay -clock mipi_dphy_rx_inst2_SLOWCLK -reference_pin [get_ports {mipi_dphy_rx_inst2_SLOWCLK~CLKOUT~1~38}] -max 1.745 [get_ports {mipi_dphy_rx_inst2_ERR_SOT_SYNC_HS_LAN2}]
#set_input_delay -clock mipi_dphy_rx_inst2_SLOWCLK -reference_pin [get_ports {mipi_dphy_rx_inst2_SLOWCLK~CLKOUT~1~38}] -min 1.163 [get_ports {mipi_dphy_rx_inst2_ERR_SOT_SYNC_HS_LAN2}]
#set_input_delay -clock mipi_dphy_rx_inst2_SLOWCLK -reference_pin [get_ports {mipi_dphy_rx_inst2_SLOWCLK~CLKOUT~1~38}] -max 1.584 [get_ports {mipi_dphy_rx_inst2_ERR_SOT_SYNC_HS_LAN3}]
#set_input_delay -clock mipi_dphy_rx_inst2_SLOWCLK -reference_pin [get_ports {mipi_dphy_rx_inst2_SLOWCLK~CLKOUT~1~38}] -min 1.056 [get_ports {mipi_dphy_rx_inst2_ERR_SOT_SYNC_HS_LAN3}]
#set_input_delay -clock mipi_dphy_rx_inst2_SLOWCLK -reference_pin [get_ports {mipi_dphy_rx_inst2_SLOWCLK~CLKOUT~1~38}] -max 1.627 [get_ports {mipi_dphy_rx_inst2_RX_ACTIVE_HS_LAN0}]
#set_input_delay -clock mipi_dphy_rx_inst2_SLOWCLK -reference_pin [get_ports {mipi_dphy_rx_inst2_SLOWCLK~CLKOUT~1~38}] -min 1.085 [get_ports {mipi_dphy_rx_inst2_RX_ACTIVE_HS_LAN0}]
#set_input_delay -clock mipi_dphy_rx_inst2_SLOWCLK -reference_pin [get_ports {mipi_dphy_rx_inst2_SLOWCLK~CLKOUT~1~38}] -max 1.644 [get_ports {mipi_dphy_rx_inst2_RX_ACTIVE_HS_LAN1}]
#set_input_delay -clock mipi_dphy_rx_inst2_SLOWCLK -reference_pin [get_ports {mipi_dphy_rx_inst2_SLOWCLK~CLKOUT~1~38}] -min 1.096 [get_ports {mipi_dphy_rx_inst2_RX_ACTIVE_HS_LAN1}]
#set_input_delay -clock mipi_dphy_rx_inst2_SLOWCLK -reference_pin [get_ports {mipi_dphy_rx_inst2_SLOWCLK~CLKOUT~1~38}] -max 1.560 [get_ports {mipi_dphy_rx_inst2_RX_ACTIVE_HS_LAN2}]
#set_input_delay -clock mipi_dphy_rx_inst2_SLOWCLK -reference_pin [get_ports {mipi_dphy_rx_inst2_SLOWCLK~CLKOUT~1~38}] -min 1.040 [get_ports {mipi_dphy_rx_inst2_RX_ACTIVE_HS_LAN2}]
#set_input_delay -clock mipi_dphy_rx_inst2_SLOWCLK -reference_pin [get_ports {mipi_dphy_rx_inst2_SLOWCLK~CLKOUT~1~38}] -max 1.493 [get_ports {mipi_dphy_rx_inst2_RX_ACTIVE_HS_LAN3}]
#set_input_delay -clock mipi_dphy_rx_inst2_SLOWCLK -reference_pin [get_ports {mipi_dphy_rx_inst2_SLOWCLK~CLKOUT~1~38}] -min 0.995 [get_ports {mipi_dphy_rx_inst2_RX_ACTIVE_HS_LAN3}]
set_input_delay -clock mipi_dphy_rx_inst2_SLOWCLK -reference_pin [get_ports {mipi_dphy_rx_inst2_SLOWCLK~CLKOUT~1~38}] -max 1.693 [get_ports {mipi_dphy_rx_inst2_RX_DATA_HS_LAN0[*]}]
set_input_delay -clock mipi_dphy_rx_inst2_SLOWCLK -reference_pin [get_ports {mipi_dphy_rx_inst2_SLOWCLK~CLKOUT~1~38}] -min 1.128 [get_ports {mipi_dphy_rx_inst2_RX_DATA_HS_LAN0[*]}]
set_input_delay -clock mipi_dphy_rx_inst2_SLOWCLK -reference_pin [get_ports {mipi_dphy_rx_inst2_SLOWCLK~CLKOUT~1~38}] -max 1.723 [get_ports {mipi_dphy_rx_inst2_RX_DATA_HS_LAN1[*]}]
set_input_delay -clock mipi_dphy_rx_inst2_SLOWCLK -reference_pin [get_ports {mipi_dphy_rx_inst2_SLOWCLK~CLKOUT~1~38}] -min 1.149 [get_ports {mipi_dphy_rx_inst2_RX_DATA_HS_LAN1[*]}]
set_input_delay -clock mipi_dphy_rx_inst2_SLOWCLK -reference_pin [get_ports {mipi_dphy_rx_inst2_SLOWCLK~CLKOUT~1~38}] -max 1.698 [get_ports {mipi_dphy_rx_inst2_RX_DATA_HS_LAN2[*]}]
set_input_delay -clock mipi_dphy_rx_inst2_SLOWCLK -reference_pin [get_ports {mipi_dphy_rx_inst2_SLOWCLK~CLKOUT~1~38}] -min 1.132 [get_ports {mipi_dphy_rx_inst2_RX_DATA_HS_LAN2[*]}]
set_input_delay -clock mipi_dphy_rx_inst2_SLOWCLK -reference_pin [get_ports {mipi_dphy_rx_inst2_SLOWCLK~CLKOUT~1~38}] -max 1.734 [get_ports {mipi_dphy_rx_inst2_RX_DATA_HS_LAN3[*]}]
set_input_delay -clock mipi_dphy_rx_inst2_SLOWCLK -reference_pin [get_ports {mipi_dphy_rx_inst2_SLOWCLK~CLKOUT~1~38}] -min 1.156 [get_ports {mipi_dphy_rx_inst2_RX_DATA_HS_LAN3[*]}]
#set_input_delay -clock mipi_dphy_rx_inst2_SLOWCLK -reference_pin [get_ports {mipi_dphy_rx_inst2_SLOWCLK~CLKOUT~1~38}] -max 1.723 [get_ports {mipi_dphy_rx_inst2_RX_SKEW_CAL_HS_LAN0}]
#set_input_delay -clock mipi_dphy_rx_inst2_SLOWCLK -reference_pin [get_ports {mipi_dphy_rx_inst2_SLOWCLK~CLKOUT~1~38}] -min 1.149 [get_ports {mipi_dphy_rx_inst2_RX_SKEW_CAL_HS_LAN0}]
#set_input_delay -clock mipi_dphy_rx_inst2_SLOWCLK -reference_pin [get_ports {mipi_dphy_rx_inst2_SLOWCLK~CLKOUT~1~38}] -max 1.656 [get_ports {mipi_dphy_rx_inst2_RX_SKEW_CAL_HS_LAN1}]
#set_input_delay -clock mipi_dphy_rx_inst2_SLOWCLK -reference_pin [get_ports {mipi_dphy_rx_inst2_SLOWCLK~CLKOUT~1~38}] -min 1.104 [get_ports {mipi_dphy_rx_inst2_RX_SKEW_CAL_HS_LAN1}]
#set_input_delay -clock mipi_dphy_rx_inst2_SLOWCLK -reference_pin [get_ports {mipi_dphy_rx_inst2_SLOWCLK~CLKOUT~1~38}] -max 1.717 [get_ports {mipi_dphy_rx_inst2_RX_SKEW_CAL_HS_LAN2}]
#set_input_delay -clock mipi_dphy_rx_inst2_SLOWCLK -reference_pin [get_ports {mipi_dphy_rx_inst2_SLOWCLK~CLKOUT~1~38}] -min 1.145 [get_ports {mipi_dphy_rx_inst2_RX_SKEW_CAL_HS_LAN2}]
#set_input_delay -clock mipi_dphy_rx_inst2_SLOWCLK -reference_pin [get_ports {mipi_dphy_rx_inst2_SLOWCLK~CLKOUT~1~38}] -max 1.583 [get_ports {mipi_dphy_rx_inst2_RX_SKEW_CAL_HS_LAN3}]
#set_input_delay -clock mipi_dphy_rx_inst2_SLOWCLK -reference_pin [get_ports {mipi_dphy_rx_inst2_SLOWCLK~CLKOUT~1~38}] -min 1.056 [get_ports {mipi_dphy_rx_inst2_RX_SKEW_CAL_HS_LAN3}]
set_input_delay -clock mipi_dphy_rx_inst2_SLOWCLK -reference_pin [get_ports {mipi_dphy_rx_inst2_SLOWCLK~CLKOUT~1~38}] -max 1.707 [get_ports {mipi_dphy_rx_inst2_RX_SYNC_HS_LAN0}]
set_input_delay -clock mipi_dphy_rx_inst2_SLOWCLK -reference_pin [get_ports {mipi_dphy_rx_inst2_SLOWCLK~CLKOUT~1~38}] -min 1.138 [get_ports {mipi_dphy_rx_inst2_RX_SYNC_HS_LAN0}]
set_input_delay -clock mipi_dphy_rx_inst2_SLOWCLK -reference_pin [get_ports {mipi_dphy_rx_inst2_SLOWCLK~CLKOUT~1~38}] -max 1.632 [get_ports {mipi_dphy_rx_inst2_RX_SYNC_HS_LAN1}]
set_input_delay -clock mipi_dphy_rx_inst2_SLOWCLK -reference_pin [get_ports {mipi_dphy_rx_inst2_SLOWCLK~CLKOUT~1~38}] -min 1.088 [get_ports {mipi_dphy_rx_inst2_RX_SYNC_HS_LAN1}]
set_input_delay -clock mipi_dphy_rx_inst2_SLOWCLK -reference_pin [get_ports {mipi_dphy_rx_inst2_SLOWCLK~CLKOUT~1~38}] -max 1.583 [get_ports {mipi_dphy_rx_inst2_RX_SYNC_HS_LAN2}]
set_input_delay -clock mipi_dphy_rx_inst2_SLOWCLK -reference_pin [get_ports {mipi_dphy_rx_inst2_SLOWCLK~CLKOUT~1~38}] -min 1.056 [get_ports {mipi_dphy_rx_inst2_RX_SYNC_HS_LAN2}]
set_input_delay -clock mipi_dphy_rx_inst2_SLOWCLK -reference_pin [get_ports {mipi_dphy_rx_inst2_SLOWCLK~CLKOUT~1~38}] -max 1.536 [get_ports {mipi_dphy_rx_inst2_RX_SYNC_HS_LAN3}]
set_input_delay -clock mipi_dphy_rx_inst2_SLOWCLK -reference_pin [get_ports {mipi_dphy_rx_inst2_SLOWCLK~CLKOUT~1~38}] -min 1.024 [get_ports {mipi_dphy_rx_inst2_RX_SYNC_HS_LAN3}]
set_input_delay -clock mipi_dphy_rx_inst2_SLOWCLK -reference_pin [get_ports {mipi_dphy_rx_inst2_SLOWCLK~CLKOUT~1~38}] -max 1.645 [get_ports {mipi_dphy_rx_inst2_RX_VALID_HS_LAN0}]
set_input_delay -clock mipi_dphy_rx_inst2_SLOWCLK -reference_pin [get_ports {mipi_dphy_rx_inst2_SLOWCLK~CLKOUT~1~38}] -min 1.097 [get_ports {mipi_dphy_rx_inst2_RX_VALID_HS_LAN0}]
set_input_delay -clock mipi_dphy_rx_inst2_SLOWCLK -reference_pin [get_ports {mipi_dphy_rx_inst2_SLOWCLK~CLKOUT~1~38}] -max 1.612 [get_ports {mipi_dphy_rx_inst2_RX_VALID_HS_LAN1}]
set_input_delay -clock mipi_dphy_rx_inst2_SLOWCLK -reference_pin [get_ports {mipi_dphy_rx_inst2_SLOWCLK~CLKOUT~1~38}] -min 1.075 [get_ports {mipi_dphy_rx_inst2_RX_VALID_HS_LAN1}]
set_input_delay -clock mipi_dphy_rx_inst2_SLOWCLK -reference_pin [get_ports {mipi_dphy_rx_inst2_SLOWCLK~CLKOUT~1~38}] -max 1.563 [get_ports {mipi_dphy_rx_inst2_RX_VALID_HS_LAN2}]
set_input_delay -clock mipi_dphy_rx_inst2_SLOWCLK -reference_pin [get_ports {mipi_dphy_rx_inst2_SLOWCLK~CLKOUT~1~38}] -min 1.042 [get_ports {mipi_dphy_rx_inst2_RX_VALID_HS_LAN2}]
set_input_delay -clock mipi_dphy_rx_inst2_SLOWCLK -reference_pin [get_ports {mipi_dphy_rx_inst2_SLOWCLK~CLKOUT~1~38}] -max 1.582 [get_ports {mipi_dphy_rx_inst2_RX_VALID_HS_LAN3}]
set_input_delay -clock mipi_dphy_rx_inst2_SLOWCLK -reference_pin [get_ports {mipi_dphy_rx_inst2_SLOWCLK~CLKOUT~1~38}] -min 1.055 [get_ports {mipi_dphy_rx_inst2_RX_VALID_HS_LAN3}]
set_input_delay -clock mipi_dphy_rx_inst2_SLOWCLK -reference_pin [get_ports {mipi_dphy_rx_inst2_SLOWCLK~CLKOUT~1~38}] -max 1.647 [get_ports {mipi_dphy_rx_inst2_STOPSTATE_LAN0}]
set_input_delay -clock mipi_dphy_rx_inst2_SLOWCLK -reference_pin [get_ports {mipi_dphy_rx_inst2_SLOWCLK~CLKOUT~1~38}] -min 1.098 [get_ports {mipi_dphy_rx_inst2_STOPSTATE_LAN0}]
set_input_delay -clock mipi_dphy_rx_inst2_SLOWCLK -reference_pin [get_ports {mipi_dphy_rx_inst2_SLOWCLK~CLKOUT~1~38}] -max 1.592 [get_ports {mipi_dphy_rx_inst2_STOPSTATE_LAN1}]
set_input_delay -clock mipi_dphy_rx_inst2_SLOWCLK -reference_pin [get_ports {mipi_dphy_rx_inst2_SLOWCLK~CLKOUT~1~38}] -min 1.061 [get_ports {mipi_dphy_rx_inst2_STOPSTATE_LAN1}]
set_input_delay -clock mipi_dphy_rx_inst2_SLOWCLK -reference_pin [get_ports {mipi_dphy_rx_inst2_SLOWCLK~CLKOUT~1~38}] -max 1.591 [get_ports {mipi_dphy_rx_inst2_STOPSTATE_LAN2}]
set_input_delay -clock mipi_dphy_rx_inst2_SLOWCLK -reference_pin [get_ports {mipi_dphy_rx_inst2_SLOWCLK~CLKOUT~1~38}] -min 1.060 [get_ports {mipi_dphy_rx_inst2_STOPSTATE_LAN2}]
set_input_delay -clock mipi_dphy_rx_inst2_SLOWCLK -reference_pin [get_ports {mipi_dphy_rx_inst2_SLOWCLK~CLKOUT~1~38}] -max 1.613 [get_ports {mipi_dphy_rx_inst2_STOPSTATE_LAN3}]
set_input_delay -clock mipi_dphy_rx_inst2_SLOWCLK -reference_pin [get_ports {mipi_dphy_rx_inst2_SLOWCLK~CLKOUT~1~38}] -min 1.075 [get_ports {mipi_dphy_rx_inst2_STOPSTATE_LAN3}]

# MIPI DPHY TX Constraints
#####################################
create_clock -period 6.4000 -name mipi_dphy_tx_inst1_SLOWCLK [get_ports {mipi_dphy_tx_inst1_SLOWCLK}]
set_output_delay -clock esc_clk -reference_pin [get_ports {esc_clk~CLKOUT~1~35}] -max 2.492 [get_ports {mipi_dphy_tx_inst1_TX_DATA_ESC[*]}]
set_output_delay -clock esc_clk -reference_pin [get_ports {esc_clk~CLKOUT~1~35}] -min 0.350 [get_ports {mipi_dphy_tx_inst1_TX_DATA_ESC[*]}]
set_output_delay -clock mipi_dphy_tx_inst1_SLOWCLK -reference_pin [get_ports {mipi_dphy_tx_inst1_SLOWCLK~CLKOUT~2~35}] -max 1.776 [get_ports {mipi_dphy_tx_inst1_TX_DATA_HS_LAN0[*]}]
set_output_delay -clock mipi_dphy_tx_inst1_SLOWCLK -reference_pin [get_ports {mipi_dphy_tx_inst1_SLOWCLK~CLKOUT~2~35}] -min 0.190 [get_ports {mipi_dphy_tx_inst1_TX_DATA_HS_LAN0[*]}]
set_output_delay -clock mipi_dphy_tx_inst1_SLOWCLK -reference_pin [get_ports {mipi_dphy_tx_inst1_SLOWCLK~CLKOUT~2~35}] -max 1.716 [get_ports {mipi_dphy_tx_inst1_TX_DATA_HS_LAN1[*]}]
set_output_delay -clock mipi_dphy_tx_inst1_SLOWCLK -reference_pin [get_ports {mipi_dphy_tx_inst1_SLOWCLK~CLKOUT~2~35}] -min 0.272 [get_ports {mipi_dphy_tx_inst1_TX_DATA_HS_LAN1[*]}]
set_output_delay -clock mipi_dphy_tx_inst1_SLOWCLK -reference_pin [get_ports {mipi_dphy_tx_inst1_SLOWCLK~CLKOUT~2~35}] -max 1.764 [get_ports {mipi_dphy_tx_inst1_TX_DATA_HS_LAN2[*]}]
set_output_delay -clock mipi_dphy_tx_inst1_SLOWCLK -reference_pin [get_ports {mipi_dphy_tx_inst1_SLOWCLK~CLKOUT~2~35}] -min 0.320 [get_ports {mipi_dphy_tx_inst1_TX_DATA_HS_LAN2[*]}]
set_output_delay -clock mipi_dphy_tx_inst1_SLOWCLK -reference_pin [get_ports {mipi_dphy_tx_inst1_SLOWCLK~CLKOUT~2~35}] -max 1.695 [get_ports {mipi_dphy_tx_inst1_TX_DATA_HS_LAN3[*]}]
set_output_delay -clock mipi_dphy_tx_inst1_SLOWCLK -reference_pin [get_ports {mipi_dphy_tx_inst1_SLOWCLK~CLKOUT~2~35}] -min 0.279 [get_ports {mipi_dphy_tx_inst1_TX_DATA_HS_LAN3[*]}]
set_output_delay -clock esc_clk -reference_pin [get_ports {esc_clk~CLKOUT~1~35}] -max 2.339 [get_ports {mipi_dphy_tx_inst1_TX_LPDT_ESC}]
set_output_delay -clock esc_clk -reference_pin [get_ports {esc_clk~CLKOUT~1~35}] -min 0.155 [get_ports {mipi_dphy_tx_inst1_TX_LPDT_ESC}]
set_output_delay -clock mipi_dphy_tx_inst1_SLOWCLK -reference_pin [get_ports {mipi_dphy_tx_inst1_SLOWCLK~CLKOUT~2~35}] -max 1.345 [get_ports {mipi_dphy_tx_inst1_TX_WORD_VALID_HS_LAN0}]
set_output_delay -clock mipi_dphy_tx_inst1_SLOWCLK -reference_pin [get_ports {mipi_dphy_tx_inst1_SLOWCLK~CLKOUT~2~35}] -min 0.064 [get_ports {mipi_dphy_tx_inst1_TX_WORD_VALID_HS_LAN0}]
set_output_delay -clock mipi_dphy_tx_inst1_SLOWCLK -reference_pin [get_ports {mipi_dphy_tx_inst1_SLOWCLK~CLKOUT~2~35}] -max 1.679 [get_ports {mipi_dphy_tx_inst1_TX_WORD_VALID_HS_LAN1}]
set_output_delay -clock mipi_dphy_tx_inst1_SLOWCLK -reference_pin [get_ports {mipi_dphy_tx_inst1_SLOWCLK~CLKOUT~2~35}] -min 0.267 [get_ports {mipi_dphy_tx_inst1_TX_WORD_VALID_HS_LAN1}]
set_output_delay -clock mipi_dphy_tx_inst1_SLOWCLK -reference_pin [get_ports {mipi_dphy_tx_inst1_SLOWCLK~CLKOUT~2~35}] -max 1.394 [get_ports {mipi_dphy_tx_inst1_TX_WORD_VALID_HS_LAN2}]
set_output_delay -clock mipi_dphy_tx_inst1_SLOWCLK -reference_pin [get_ports {mipi_dphy_tx_inst1_SLOWCLK~CLKOUT~2~35}] -min 0.273 [get_ports {mipi_dphy_tx_inst1_TX_WORD_VALID_HS_LAN2}]
set_output_delay -clock mipi_dphy_tx_inst1_SLOWCLK -reference_pin [get_ports {mipi_dphy_tx_inst1_SLOWCLK~CLKOUT~2~35}] -max 1.590 [get_ports {mipi_dphy_tx_inst1_TX_WORD_VALID_HS_LAN3}]
set_output_delay -clock mipi_dphy_tx_inst1_SLOWCLK -reference_pin [get_ports {mipi_dphy_tx_inst1_SLOWCLK~CLKOUT~2~35}] -min 0.241 [get_ports {mipi_dphy_tx_inst1_TX_WORD_VALID_HS_LAN3}]
set_output_delay -clock esc_clk -reference_pin [get_ports {esc_clk~CLKOUT~1~35}] -max 2.634 [get_ports {mipi_dphy_tx_inst1_TX_REQUEST_ESC_LAN0}]
set_output_delay -clock esc_clk -reference_pin [get_ports {esc_clk~CLKOUT~1~35}] -min 0.121 [get_ports {mipi_dphy_tx_inst1_TX_REQUEST_ESC_LAN0}]
set_output_delay -clock esc_clk -reference_pin [get_ports {esc_clk~CLKOUT~1~35}] -max 2.612 [get_ports {mipi_dphy_tx_inst1_TX_REQUEST_ESC_LAN1}]
set_output_delay -clock esc_clk -reference_pin [get_ports {esc_clk~CLKOUT~1~35}] -min 0.287 [get_ports {mipi_dphy_tx_inst1_TX_REQUEST_ESC_LAN1}]
set_output_delay -clock esc_clk -reference_pin [get_ports {esc_clk~CLKOUT~1~35}] -max 2.671 [get_ports {mipi_dphy_tx_inst1_TX_REQUEST_ESC_LAN2}]
set_output_delay -clock esc_clk -reference_pin [get_ports {esc_clk~CLKOUT~1~35}] -min 0.328 [get_ports {mipi_dphy_tx_inst1_TX_REQUEST_ESC_LAN2}]
set_output_delay -clock esc_clk -reference_pin [get_ports {esc_clk~CLKOUT~1~35}] -max 2.629 [get_ports {mipi_dphy_tx_inst1_TX_REQUEST_ESC_LAN3}]
set_output_delay -clock esc_clk -reference_pin [get_ports {esc_clk~CLKOUT~1~35}] -min 0.263 [get_ports {mipi_dphy_tx_inst1_TX_REQUEST_ESC_LAN3}]
set_output_delay -clock mipi_dphy_tx_inst1_SLOWCLK -reference_pin [get_ports {mipi_dphy_tx_inst1_SLOWCLK~CLKOUT~2~35}] -max 1.393 [get_ports {mipi_dphy_tx_inst1_TX_REQUEST_HS}]
set_output_delay -clock mipi_dphy_tx_inst1_SLOWCLK -reference_pin [get_ports {mipi_dphy_tx_inst1_SLOWCLK~CLKOUT~2~35}] -min 0.214 [get_ports {mipi_dphy_tx_inst1_TX_REQUEST_HS}]
set_output_delay -clock mipi_dphy_tx_inst1_SLOWCLK -reference_pin [get_ports {mipi_dphy_tx_inst1_SLOWCLK~CLKOUT~2~35}] -max 1.483 [get_ports {mipi_dphy_tx_inst1_TX_REQUEST_HS_LAN0}]
set_output_delay -clock mipi_dphy_tx_inst1_SLOWCLK -reference_pin [get_ports {mipi_dphy_tx_inst1_SLOWCLK~CLKOUT~2~35}] -min 0.043 [get_ports {mipi_dphy_tx_inst1_TX_REQUEST_HS_LAN0}]
set_output_delay -clock mipi_dphy_tx_inst1_SLOWCLK -reference_pin [get_ports {mipi_dphy_tx_inst1_SLOWCLK~CLKOUT~2~35}] -max 1.641 [get_ports {mipi_dphy_tx_inst1_TX_REQUEST_HS_LAN1}]
set_output_delay -clock mipi_dphy_tx_inst1_SLOWCLK -reference_pin [get_ports {mipi_dphy_tx_inst1_SLOWCLK~CLKOUT~2~35}] -min 0.190 [get_ports {mipi_dphy_tx_inst1_TX_REQUEST_HS_LAN1}]
set_output_delay -clock mipi_dphy_tx_inst1_SLOWCLK -reference_pin [get_ports {mipi_dphy_tx_inst1_SLOWCLK~CLKOUT~2~35}] -max 1.804 [get_ports {mipi_dphy_tx_inst1_TX_REQUEST_HS_LAN2}]
set_output_delay -clock mipi_dphy_tx_inst1_SLOWCLK -reference_pin [get_ports {mipi_dphy_tx_inst1_SLOWCLK~CLKOUT~2~35}] -min 0.213 [get_ports {mipi_dphy_tx_inst1_TX_REQUEST_HS_LAN2}]
set_output_delay -clock mipi_dphy_tx_inst1_SLOWCLK -reference_pin [get_ports {mipi_dphy_tx_inst1_SLOWCLK~CLKOUT~2~35}] -max 1.680 [get_ports {mipi_dphy_tx_inst1_TX_REQUEST_HS_LAN3}]
set_output_delay -clock mipi_dphy_tx_inst1_SLOWCLK -reference_pin [get_ports {mipi_dphy_tx_inst1_SLOWCLK~CLKOUT~2~35}] -min 0.193 [get_ports {mipi_dphy_tx_inst1_TX_REQUEST_HS_LAN3}]
set_output_delay -clock mipi_dphy_tx_inst1_SLOWCLK -reference_pin [get_ports {mipi_dphy_tx_inst1_SLOWCLK~CLKOUT~2~35}] -max 1.342 [get_ports {mipi_dphy_tx_inst1_TX_SKEW_CAL_HS_LAN0}]
set_output_delay -clock mipi_dphy_tx_inst1_SLOWCLK -reference_pin [get_ports {mipi_dphy_tx_inst1_SLOWCLK~CLKOUT~2~35}] -min 0.069 [get_ports {mipi_dphy_tx_inst1_TX_SKEW_CAL_HS_LAN0}]
set_output_delay -clock mipi_dphy_tx_inst1_SLOWCLK -reference_pin [get_ports {mipi_dphy_tx_inst1_SLOWCLK~CLKOUT~2~35}] -max 1.709 [get_ports {mipi_dphy_tx_inst1_TX_SKEW_CAL_HS_LAN1}]
set_output_delay -clock mipi_dphy_tx_inst1_SLOWCLK -reference_pin [get_ports {mipi_dphy_tx_inst1_SLOWCLK~CLKOUT~2~35}] -min 0.177 [get_ports {mipi_dphy_tx_inst1_TX_SKEW_CAL_HS_LAN1}]
set_output_delay -clock mipi_dphy_tx_inst1_SLOWCLK -reference_pin [get_ports {mipi_dphy_tx_inst1_SLOWCLK~CLKOUT~2~35}] -max 1.545 [get_ports {mipi_dphy_tx_inst1_TX_SKEW_CAL_HS_LAN2}]
set_output_delay -clock mipi_dphy_tx_inst1_SLOWCLK -reference_pin [get_ports {mipi_dphy_tx_inst1_SLOWCLK~CLKOUT~2~35}] -min 0.257 [get_ports {mipi_dphy_tx_inst1_TX_SKEW_CAL_HS_LAN2}]
set_output_delay -clock mipi_dphy_tx_inst1_SLOWCLK -reference_pin [get_ports {mipi_dphy_tx_inst1_SLOWCLK~CLKOUT~2~35}] -max 1.520 [get_ports {mipi_dphy_tx_inst1_TX_SKEW_CAL_HS_LAN3}]
set_output_delay -clock mipi_dphy_tx_inst1_SLOWCLK -reference_pin [get_ports {mipi_dphy_tx_inst1_SLOWCLK~CLKOUT~2~35}] -min 0.190 [get_ports {mipi_dphy_tx_inst1_TX_SKEW_CAL_HS_LAN3}]
set_output_delay -clock esc_clk -reference_pin [get_ports {esc_clk~CLKOUT~1~35}] -max 2.540 [get_ports {mipi_dphy_tx_inst1_TX_TRIGGER_ESC[3] mipi_dphy_tx_inst1_TX_TRIGGER_ESC[2] mipi_dphy_tx_inst1_TX_TRIGGER_ESC[1] mipi_dphy_tx_inst1_TX_TRIGGER_ESC[0]}]
set_output_delay -clock esc_clk -reference_pin [get_ports {esc_clk~CLKOUT~1~35}] -min 0.281 [get_ports {mipi_dphy_tx_inst1_TX_TRIGGER_ESC[3] mipi_dphy_tx_inst1_TX_TRIGGER_ESC[2] mipi_dphy_tx_inst1_TX_TRIGGER_ESC[1] mipi_dphy_tx_inst1_TX_TRIGGER_ESC[0]}]
set_output_delay -clock esc_clk -reference_pin [get_ports {esc_clk~CLKOUT~1~35}] -max 1.967 [get_ports {mipi_dphy_tx_inst1_TX_ULPS_CLK}]
set_output_delay -clock esc_clk -reference_pin [get_ports {esc_clk~CLKOUT~1~35}] -min 0.219 [get_ports {mipi_dphy_tx_inst1_TX_ULPS_CLK}]
set_output_delay -clock esc_clk -reference_pin [get_ports {esc_clk~CLKOUT~1~35}] -max 2.537 [get_ports {mipi_dphy_tx_inst1_TX_ULPS_ESC_LAN0}]
set_output_delay -clock esc_clk -reference_pin [get_ports {esc_clk~CLKOUT~1~35}] -min 0.300 [get_ports {mipi_dphy_tx_inst1_TX_ULPS_ESC_LAN0}]
set_output_delay -clock esc_clk -reference_pin [get_ports {esc_clk~CLKOUT~1~35}] -max 2.639 [get_ports {mipi_dphy_tx_inst1_TX_ULPS_ESC_LAN1}]
set_output_delay -clock esc_clk -reference_pin [get_ports {esc_clk~CLKOUT~1~35}] -min 0.181 [get_ports {mipi_dphy_tx_inst1_TX_ULPS_ESC_LAN1}]
set_output_delay -clock esc_clk -reference_pin [get_ports {esc_clk~CLKOUT~1~35}] -max 2.556 [get_ports {mipi_dphy_tx_inst1_TX_ULPS_ESC_LAN2}]
set_output_delay -clock esc_clk -reference_pin [get_ports {esc_clk~CLKOUT~1~35}] -min 0.293 [get_ports {mipi_dphy_tx_inst1_TX_ULPS_ESC_LAN2}]
set_output_delay -clock esc_clk -reference_pin [get_ports {esc_clk~CLKOUT~1~35}] -max 2.410 [get_ports {mipi_dphy_tx_inst1_TX_ULPS_ESC_LAN3}]
set_output_delay -clock esc_clk -reference_pin [get_ports {esc_clk~CLKOUT~1~35}] -min 0.273 [get_ports {mipi_dphy_tx_inst1_TX_ULPS_ESC_LAN3}]
set_output_delay -clock esc_clk -reference_pin [get_ports {esc_clk~CLKOUT~1~35}] -max 1.821 [get_ports {mipi_dphy_tx_inst1_TX_ULPS_EXIT}]
set_output_delay -clock esc_clk -reference_pin [get_ports {esc_clk~CLKOUT~1~35}] -min 0.239 [get_ports {mipi_dphy_tx_inst1_TX_ULPS_EXIT}]
set_output_delay -clock esc_clk -reference_pin [get_ports {esc_clk~CLKOUT~1~35}] -max 2.910 [get_ports {mipi_dphy_tx_inst1_TX_ULPS_EXIT_LAN0}]
set_output_delay -clock esc_clk -reference_pin [get_ports {esc_clk~CLKOUT~1~35}] -min 0.172 [get_ports {mipi_dphy_tx_inst1_TX_ULPS_EXIT_LAN0}]
set_output_delay -clock esc_clk -reference_pin [get_ports {esc_clk~CLKOUT~1~35}] -max 2.781 [get_ports {mipi_dphy_tx_inst1_TX_ULPS_EXIT_LAN1}]
set_output_delay -clock esc_clk -reference_pin [get_ports {esc_clk~CLKOUT~1~35}] -min 0.205 [get_ports {mipi_dphy_tx_inst1_TX_ULPS_EXIT_LAN1}]
set_output_delay -clock esc_clk -reference_pin [get_ports {esc_clk~CLKOUT~1~35}] -max 2.395 [get_ports {mipi_dphy_tx_inst1_TX_ULPS_EXIT_LAN2}]
set_output_delay -clock esc_clk -reference_pin [get_ports {esc_clk~CLKOUT~1~35}] -min 0.386 [get_ports {mipi_dphy_tx_inst1_TX_ULPS_EXIT_LAN2}]
set_output_delay -clock esc_clk -reference_pin [get_ports {esc_clk~CLKOUT~1~35}] -max 2.491 [get_ports {mipi_dphy_tx_inst1_TX_ULPS_EXIT_LAN3}]
set_output_delay -clock esc_clk -reference_pin [get_ports {esc_clk~CLKOUT~1~35}] -min 0.306 [get_ports {mipi_dphy_tx_inst1_TX_ULPS_EXIT_LAN3}]
set_output_delay -clock esc_clk -reference_pin [get_ports {esc_clk~CLKOUT~1~35}] -max 2.349 [get_ports {mipi_dphy_tx_inst1_TX_VALID_ESC}]
set_output_delay -clock esc_clk -reference_pin [get_ports {esc_clk~CLKOUT~1~35}] -min 0.295 [get_ports {mipi_dphy_tx_inst1_TX_VALID_ESC}]
set_input_delay -clock mipi_dphy_tx_inst1_SLOWCLK -reference_pin [get_ports {mipi_dphy_tx_inst1_SLOWCLK~CLKOUT~2~35}] -max 2.416 [get_ports {mipi_dphy_tx_inst1_TX_READY_HS_LAN0}]
set_input_delay -clock mipi_dphy_tx_inst1_SLOWCLK -reference_pin [get_ports {mipi_dphy_tx_inst1_SLOWCLK~CLKOUT~2~35}] -min 1.611 [get_ports {mipi_dphy_tx_inst1_TX_READY_HS_LAN0}]
set_input_delay -clock mipi_dphy_tx_inst1_SLOWCLK -reference_pin [get_ports {mipi_dphy_tx_inst1_SLOWCLK~CLKOUT~2~35}] -max 2.406 [get_ports {mipi_dphy_tx_inst1_TX_READY_HS_LAN1}]
set_input_delay -clock mipi_dphy_tx_inst1_SLOWCLK -reference_pin [get_ports {mipi_dphy_tx_inst1_SLOWCLK~CLKOUT~2~35}] -min 1.604 [get_ports {mipi_dphy_tx_inst1_TX_READY_HS_LAN1}]
set_input_delay -clock mipi_dphy_tx_inst1_SLOWCLK -reference_pin [get_ports {mipi_dphy_tx_inst1_SLOWCLK~CLKOUT~2~35}] -max 2.610 [get_ports {mipi_dphy_tx_inst1_TX_READY_HS_LAN2}]
set_input_delay -clock mipi_dphy_tx_inst1_SLOWCLK -reference_pin [get_ports {mipi_dphy_tx_inst1_SLOWCLK~CLKOUT~2~35}] -min 1.740 [get_ports {mipi_dphy_tx_inst1_TX_READY_HS_LAN2}]
set_input_delay -clock mipi_dphy_tx_inst1_SLOWCLK -reference_pin [get_ports {mipi_dphy_tx_inst1_SLOWCLK~CLKOUT~2~35}] -max 2.543 [get_ports {mipi_dphy_tx_inst1_TX_READY_HS_LAN3}]
set_input_delay -clock mipi_dphy_tx_inst1_SLOWCLK -reference_pin [get_ports {mipi_dphy_tx_inst1_SLOWCLK~CLKOUT~2~35}] -min 1.695 [get_ports {mipi_dphy_tx_inst1_TX_READY_HS_LAN3}]
#set_input_delay -clock esc_clk -reference_pin [get_ports {esc_clk~CLKOUT~1~35}] -max 4.023 [get_ports {mipi_dphy_tx_inst1_TX_READY_ESC}]
#set_input_delay -clock esc_clk -reference_pin [get_ports {esc_clk~CLKOUT~1~35}] -min 2.682 [get_ports {mipi_dphy_tx_inst1_TX_READY_ESC}]

# HSIO GPIO Constraints
#########################
# set_input_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {i_inject_err_n}]
# set_input_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {i_inject_err_n}]
# set_input_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {reset_n}]
# set_input_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {reset_n}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {led[0]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {led[0]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {led[1]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {led[1]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {led[2]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {led[2]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {led[3]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {led[3]}]

# Clock Latency Constraints
############################
# set_clock_latency -source -setup <pll_clk_latency_pll_inst2_CLKOUT2_max + 2.395> [get_ports {clk0}]
# set_clock_latency -source -hold <pll_clk_latency_pll_inst2_CLKOUT2_min + 1.550> [get_ports {clk0}]
# set_clock_latency -source -setup <pll_clk_latency_pll_inst2_CLKOUT2_max + 2.395> [get_ports {pixel_clk}]
# set_clock_latency -source -hold <pll_clk_latency_pll_inst2_CLKOUT2_min + 1.550> [get_ports {pixel_clk}]
# set_clock_latency -source -setup <pll_clk_latency_pll_inst2_CLKOUT2_max + 2.395> [get_ports {mipi_clk}]
# set_clock_latency -source -hold <pll_clk_latency_pll_inst2_CLKOUT2_min + 1.550> [get_ports {mipi_clk}]
# set_clock_latency -source -setup <board_max + 0.828> [get_ports {cfg_clk}]
# set_clock_latency -source -hold <board_min + 0.552> [get_ports {cfg_clk}]
# set_clock_latency -source -setup <board_max + 0.828> [get_ports {esc_clk}]
# set_clock_latency -source -hold <board_min + 0.552> [get_ports {esc_clk}]
# set_clock_latency -source -setup <board_max + 0.828> [get_ports {pll_inst2_CLKOUT2}]
# set_clock_latency -source -hold <board_min + 0.552> [get_ports {pll_inst2_CLKOUT2}]
# set_clock_latency -source -setup <board_max + 0.828> [get_ports {pll_inst2_CLKOUT3}]
# set_clock_latency -source -hold <board_min + 0.552> [get_ports {pll_inst2_CLKOUT3}]

set_clock_groups -exclusive -group {mipi_clk} -group {mipi_dphy_rx_inst2_SLOWCLK} -group {pixel_clk}
set_clock_groups -exclusive -group {mipi_clk} -group {mipi_dphy_tx_inst1_SLOWCLK} -group {pixel_clk} -group {esc_clk}

